{
  "symbol": "K",
  "price": 82.46,
  "beta": 0.276,
  "volAvg": 2791803,
  "mktCap": 28668802232,
  "lastDiv": 2.29,
  "range": "76.48-83.22",
  "changes": 0.44,
  "companyName": "Kellanova",
  "currency": "USD",
  "cik": "0000055067",
  "isin": "US4878361082",
  "cusip": "487836108",
  "exchange": "New York Stock Exchange",
  "exchangeShortName": "NYSE",
  "industry": "Food Confectioners",
  "website": "https://www.kelloggcompany.com",
  "description": "Kellanova, together with its subsidiaries, manufactures and markets snacks and convenience foods in North America, Europe, Latin America, the Asia Pacific, the Middle East, Australia, and Africa. Its principal products consist of snacks, such as crackers, savory snacks, toaster pastries, cereal bars, granola bars, and bites; and convenience foods, including ready-to-eat cereals, frozen waffles, veggie foods, and noodles; and crisps. The company offers its products under the Kellogg's, Cheez-It, Pringles, Austin, Parati, RXBAR, Eggo, Morningstar Farms, Bisco, Club, Luxe, Minueto, Special K, Toasteds, Town House, Zesta, Zoo Cartoon, Choco Krispis, Crunchy Nut, Kashi, Nutri-Grain, Squares, Zucaritas, Rice Krispies Treats, Sucrilhos, Pop-Tarts, K-Time, Sunibrite, Split Stix, LCMs, Coco Pops, Krave, Frosties, Rice Krispies Squares, Incogmeato, Veggitizers, Gardenburger, Trink, Carr's, Kellogg's Extra, Müsli, Fruit n Fibre, Kellogg's Crunchy Nut, Country Store, Smacks, Honey Bsss, Zimmy's, Toppas, Tresor, Froot Ring, Chocos, Chex, Guardian, Just Right, Sultana Bran, Rice Bubbles, Sustain, Choco Krispies, Melvin, Cornelius, Chocovore, Poperto, Pops the Bee, and Sammy the Seal brand names. It sells its products to retailers through direct sales forces, as well as brokers and distributors. The company was formerly known as Kellogg Company and changed its name to Kellanova in October 2023. Kellanova was founded in 1906 and is headquartered in Chicago, Illinois.",
  "ceo": "Steven A. Cahillane",
  "sector": "Consumer Defensive",
  "country": "US",
  "fullTimeEmployees": "24000",
  "phone": "269-961-2000",
  "address": "One Kellogg Square",
  "city": "Chicago",
  "state": "MI",
  "zip": "49016-3599",
  "dcfDiff": 3.83116,
  "dcf": 78.62883975462888,
  "image": "https://images.financialmodelingprep.com/symbol/K.png",
  "ipoDate": "1952-01-08",
  "defaultImage": false,
  "isEtf": false,
  "isActivelyTrading": true,
  "isAdr": false,
  "isFund": false
}