{
  "symbol": "SW",
  "price": 42.66,
  "beta": 1.02,
  "volAvg": 3951493,
  "mktCap": 22273854377,
  "lastDiv": 1.5949,
  "range": "37.01-56.986",
  "changes": 0.09,
  "companyName": "Smurfit Westrock Plc",
  "currency": "USD",
  "cik": "0002005951",
  "isin": "IE00028FXN24",
  "cusip": null,
  "exchange": "New York Stock Exchange",
  "exchangeShortName": "NYSE",
  "industry": "Packaging & Containers",
  "website": "https://www.smurfitwestrock.com",
  "description": "Smurfit Westrock Plc, together with its subsidiaries, manufactures, distributes, and sells containerboard, corrugated containers, and other paper-based packaging products in Ireland and internationally. The company produces containerboard that it converts into corrugated containers or sells to third parties, as well as produces other types of paper, such as consumer packaging board, sack paper, graphic paper, solid board and graphic board, and other paper-based packaging products, such as consumer packaging, solid board packaging, paper sacks, and other packaging products, including bag-in-box. It also produces linerboard and corrugated medium, paperboard, and non-packaging grades of paper, as well as converted products, such as folding cartons and corrugated boxes, and other products; recycled paper-based packaging products; and packaging machinery. The company primarily serves food and beverage, e-commerce, retail, consumer goods, industrial, and foodservice markets. Smurfit Westrock Plc was founded in 1934 and is headquartered in Dublin, Ireland.",
  "ceo": "Anthony Paul J. Smurfit",
  "sector": "Consumer Cyclical",
  "country": "IE",
  "fullTimeEmployees": "100000",
  "phone": "353 1 202 7000",
  "address": "Beech Hill",
  "city": "Dublin",
  "state": null,
  "zip": "D04 N2R2",
  "dcfDiff": -60.20889,
  "dcf": 104.67888964841032,
  "image": "https://images.financialmodelingprep.com/symbol/SW.png",
  "ipoDate": "2024-07-08",
  "defaultImage": true,
  "isEtf": false,
  "isActivelyTrading": true,
  "isAdr": false,
  "isFund": false
}